### Plan: 2 to add, 0 to change, 2 to destroy.
```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

# module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
    ~ id             = "rtbassoc-0184c17b252ac4680" -> (known after apply)
      route_table_id = "rtb-012c0c5b3800927a2"
    ~ subnet_id      = "subnet-0894a8f3c2c3248b0" -> (known after apply) # forces replacement
  }

# module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
    ~ arn                             = "arn:aws:ec2:eu-west-1:834895675414:subnet/subnet-0894a8f3c2c3248b0" -> (known after apply)
      assign_ipv6_address_on_creation = false
      availability_zone               = "eu-west-1b"
    ~ availability_zone_id            = "euw1-az2" -> (known after apply)
    ~ cidr_block                      = "10.3.2.0/24" -> "10.3.3.0/24" # forces replacement
    ~ id                              = "subnet-0894a8f3c2c3248b0" -> (known after apply)
    + ipv6_cidr_block_association_id  = (known after apply)
      map_public_ip_on_launch         = true
    ~ owner_id                        = "834895675414" -> (known after apply)
      tags                            = {
          "Environment" = "prd"
          "Name"        = "tfmultienv-prd-public-eu-west-1b"
          "Terraform"   = "true"
      }
      vpc_id                          = "vpc-054848ca08d757da3"
  }

Plan: 2 to add, 0 to change, 2 to destroy.

```
